app/views/memberships/index.html.erb

        <div class="col">
         <b><%= t.user.firstname %> <%= t.user.lastname %> </b>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]