app/views/contents/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="col-8">
       <p>Créé le <%= @content.created_at %>, par <%= @content.user.firstname %> - Modifié le <%= @content.updated_at %></p>