app/views/schedules/index.html.erb

SELECT "activities".* FROM "activities" INNER JOIN "schedules_activities" ON "activities"."id" = "schedules_activities"."activity_id" WHERE "schedules_activities"."schedule_id" = $1  [["schedule_id", 4]]
---
        <div class="col-2">
          <% s.activities.each do |a| %>