app/views/activity_types/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <div class="col-4">
          <%= t.user.firstname %>