app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)
    @activity.user = current_user
    @activity.save
---
INSERT INTO "activities" ("title", "activity_type", "public", "duration", "links", "language", "status", "created_at", "updated_at", "user_id", "teaser") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @activity.update!(activity_params)
---
UPDATE "activities" SET "teaser" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["teaser", "mqfkdjmfkqjmkdsjfqmkdjfkqs\r\nchapeau"], ["updated_at", "2020-12-27 00:21:51.537789"], ["id", 1]]

  def destroy
    @activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 1]]

  def find_activity
    @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def find_tags
    @tags = Tag.all
---
SELECT "tags".* FROM "tags" WHERE 1=0

  def find_activitytypes
    @activitytypes = Activitytype.all
---
SELECT "activitytypes".* FROM "activitytypes"