app/controllers/activity_types_controller.rb

  def index
    @activity_types = ActivityType.all
---
SELECT "activity_types".* FROM "activity_types"

  def create
    @activity_type = ActivityType.new(activity_type_params)
    @activity_type.user = current_user
    @activity_type.save
---
INSERT INTO "activity_types" ("title", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Animation scolaire"], ["status", "published"], ["created_at", "2020-12-29 11:46:20.141159"], ["updated_at", "2020-12-29 11:46:20.141159"], ["user_id", 1]]

  def destroy
    @activity_type.destroy
---
DELETE FROM "activity_types" WHERE "activity_types"."id" = $1  [["id", 2]]

  def find_activity_type
    @activity_type = ActivityType.find(params[:id])
---
SELECT "activity_types".* FROM "activity_types" WHERE "activity_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]