app/controllers/activitytypes_controller.rb

SELECT "activitytypes".* FROM "activitytypes"
---
  def index
    @activitytypes = Activitytype.all.sort_by(&:title)

INSERT INTO "activitytypes" ("title", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Animation scolaire"], ["status", "active"], ["created_at", "2020-12-30 12:41:08.754537"], ["updated_at", "2020-12-30 12:41:08.754537"], ["user_id", 1]]
---
  def create
    @activitytype = Activitytype.new(activitytype_params)
    @activitytype.user = current_user
    @activitytype.save

UPDATE "activitytypes" SET "status" = $1, "updated_at" = $2 WHERE "activitytypes"."id" = $3  [["status", "inactive"], ["updated_at", "2020-12-30 12:41:15.099927"], ["id", 1]]
---
  def update
    @activitytype.update!(activitytype_params)

DELETE FROM "activitytypes" WHERE "activitytypes"."id" = $1  [["id", 1]]
---
  def destroy
    @activitytype.destroy

SELECT "activitytypes".* FROM "activitytypes" WHERE "activitytypes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_activitytype
    @activitytype = Activitytype.find(params[:id])