app/controllers/contents_controller.rb

  def show
    @content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @content = Content.new(content_params)
    @content.user = current_user
    @content.save
---
INSERT INTO "contents" ("title", "status", "teaser", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test rubrique"], ["status", "draft"], ["teaser", ""], ["user_id", 1], ["created_at", "2020-12-26 22:45:24.379979"], ["updated_at", "2020-12-26 22:45:24.379979"]]

  def update
    @content.update!(content_params)
---
UPDATE "contents" SET "updated_at" = $1 WHERE "contents"."id" = $2  [["updated_at", "2020-12-26 23:09:21.790516"], ["id", 2]]

  def destroy
    @content.destroy
---
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 3]]

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def find_content
    @content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_tags
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"