app/controllers/memberships_controller.rb

  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user
    @membership.save
---
INSERT INTO "memberships" ("price", "start_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 10], ["start_date", "2020-12-28"], ["user_id", 1], ["created_at", "2020-12-28 16:08:04.919064"], ["updated_at", "2020-12-28 16:08:04.919064"]]

  def destroy
    @membership.destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 1]]

  def find_membership
    @membership = Membership.find(params[:id])
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]