app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user = current_user
    @product.save
---
INSERT INTO "products" ("name", "product_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Miel artisanal belge - toutes fleurs"], ["product_type", "miel"], ["user_id", 1], ["created_at", "2020-12-28 18:25:09.645822"], ["updated_at", "2020-12-28 18:25:09.645822"]]

  def update
    @product.update!(product_params)
---
UPDATE "products" SET "product_type" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["product_type", ""], ["updated_at", "2020-12-28 17:00:08.468892"], ["id", 1]]

  def find_product
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]