app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("schedule_date", "classes_qty", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["schedule_date", "2020-02-28"], ["classes_qty", 2], ["status", "pending"], ["user_id", 1], ["created_at", "2020-12-28 14:42:40.154491"], ["updated_at", "2020-12-28 14:42:40.154491"]]
---
  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.user = current_user
    @schedule.save

UPDATE "schedules" SET "classes_qty" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["classes_qty", 12], ["updated_at", "2020-12-27 16:04:18.617888"], ["id", 2]]
---
  def update
    @schedule.update!(schedule_params)

DELETE FROM "schedules" WHERE "schedules"."id" = $1  [["id", 6]]
---
  def destroy
    @schedule.destroy

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def find_schedule
    @schedule = Schedule.find(params[:id])

SELECT "activities".* FROM "activities" WHERE 1=0
---
  def find_activities
    @activities = Activity.all

SELECT "users".* FROM "users" WHERE "users"."animator" = $1  [["animator", true]]
---
  def find_users
    @users = User.where(animator: true)