app/controllers/stocks_controller.rb

  def create
    @stock = Stock.new(stock_params)
    @stock.user = current_user
    @stock.save
---
INSERT INTO "stocks" ("product_id", "origin", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 2], ["origin", ""], ["created_at", "2020-12-30 11:48:28.873195"], ["updated_at", "2020-12-30 11:48:28.873195"], ["user_id", 1]]

  def update
    @stock.update!(stock_params)
---
UPDATE "stocks" SET "producer" = $1, "comment" = $2, "origin" = $3, "production_date" = $4, "quantity" = $5, "updated_at" = $6 WHERE "stocks"."id" = $7  [["producer", "Terre@Air"], ["comment", ""], ["origin", "Belgique"], ["production_date", "Mai 2020"], ["quantity", 1], ["updated_at", "2020-12-30 11:54:00.232795"], ["id", 2]]

  def destroy
    @stock.destroy
---
DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 1]]

  def find_stock
    @stock = Stock.find(params[:id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_products
    @products = Product.all
---
SELECT "products".* FROM "products"