app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @tags = Tag.all.sort_by(&:title)

INSERT INTO "tags" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Accueil"], ["description", "Affiche le contenu tagué sur la page d'accueil"], ["created_at", "2020-12-26 22:01:54.601394"], ["updated_at", "2020-12-26 22:01:54.601394"]]
---
  def create
    @tag = Tag.new(tag_params)
    @tag.save

UPDATE "tags" SET "description" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["description", "Affiche le contenu tagué sur la page d'accueil."], ["updated_at", "2020-12-26 22:02:04.749754"], ["id", 1]]
---
  def update
    @tag.update!(tag_params)

DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 1]]
---
  def destroy
    @tag.destroy

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_tag
    @tag = Tag.find(params[:id])