app/controllers/users_controller.rb

  def update
    @user.update!(user_params)
---
UPDATE "users" SET "firstname" = $1, "lastname" = $2, "editor" = $3, "animator" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["firstname", "Test"], ["lastname", "Produtest"], ["editor", false], ["animator", true], ["updated_at", "2020-12-28 14:41:19.437664"], ["id", 2]]