app/views/activities/index.html.erb

SELECT "activities".* FROM "activities"
---
        <div class="col">
          <% c.activitytypes.each do |t| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <div class="col">
          <%= c.user.firstname %>