app/views/activities/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="col-8">
       <p>Créé le <%= @activity.created_at %>, par <%= @activity.user.firstname %> - Modifié le <%= @activity.updated_at %></p>