app/views/products/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="col-8">
       <p>Créé le <%= @product.created_at %>, par <%= @product.user.firstname %> - Modifié le <%= @product.updated_at %></p>